title: Credential Dumping via comsvcs.dll MiniDump
id: f7e0e548-f99a-48be-b8e6-67d32f0baf9f
status: experimental
description: |
  Detects the execution of `rundll32.exe` calling `comsvcs.dll` with the *MiniDump* argument,
  a technique used to dump LSASS credentials
  (MITRE ATT&CK T1003.001 – OS Credential Dumping: LSASS Memory).
author: joanfx
date: 2026-04-02
references:
  - https://attack.mitre.org/techniques/T1003/001/
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    EventID: 1
    Image|endswith: '\rundll32.exe'
    CommandLine|contains|all:
      - 'comsvcs.dll'
      - 'MiniDump'
  condition: selection
level: high
tags:
  - attack.credential_access
  - attack.t1003.001
  - attack.t1003
  - exfiltration
  - persistence
falsepositives:
  - Legitimate debugging or troubleshooting tools that invoke
    `comsvcs.dll` with the `MiniDump` flag.