title: Suspicious PowerShell Encoded Command
id: 3d304fda-78aa-43ed-975c-d740798a49c1
status: experimental
description: Detects the use of base64 encoded commands in PowerShell, a common obfuscation technique used by malware and attackers.
author: joanfx
date: 2026-03-18
tags:
    - attack.execution
    - attack.t1059.001
    - attack.defense_evasion
    - attack.t1027
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        CommandLine|contains:
            - ' -EncodedCommand '
            - ' -enc '
            - ' -en '
            - ' -e '
    condition: selection
level: high